Tekla Open API Reference for Tekla Structures 2025
Point Constructor (Point)
 Instantiates a point with the given other point.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point(
	Point Point
)
Public Sub New (
	Point As Point
)
Parameters
Point
Type: Tekla.Structures.Geometry3d.Point
The other point to be used.
See Also
Reference
Point Class
Point Overload
Tekla.Structures.Geometry3d Namespace